Revit 2027 API
Reference Constructor
Creates a Reference with the supplied element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference(
	Element element
)
Public Sub New (
	element As Element
)
public:
Reference(
	Element^ element
)
new :
        element : Element -> Reference
Parameters
element Element
The element to create a reference.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the parameter is null.
See Also
Reference
Reference Class
Autodesk.Revit.DB Namespace